#+PROPERTY: header-args:sqlite :db data/predictions.db :colnames yes

Собираем данные.
#+begin_src sh
  python validate_models.py
#+end_src

#+RESULTS:

Лог сборки данных.
#+begin_src sh
  cat main.log
#+end_src

#+RESULTS:
| 2026-04-06 18:07:42 | 512 [INFO] Using device: cpu          |
| 2026-04-06 18:07:46 | 842 [INFO] Loading poetry dataset     |
| 2026-04-06 18:07:50 | 292 [INFO] Dataset loading finished   |
| 2026-04-06 18:09:18 | 780 [INFO] accent_accuracy=0.985116   |
| 2026-04-06 18:09:18 | 780 [INFO] meter_accuracy=0.973385    |
| 2026-04-06 18:09:18 | 780 [INFO] caesura_accuracy=0.992509  |
| 2026-04-06 18:09:18 | 780 [INFO] unstable_accuracy=0.999266 |

Для каждого метра собираем соотношение попаданий при правильно
предсказанном ритме, ошибочно предсказанном ритме и общее соотношение
правильных предсказаний.
#+begin_src sqlite
  SELECT
      meter_target,
      ROUND(AVG(CASE WHEN accent_target == accent_pred THEN meter_target == meter_pred END), 3) AS meter_ok_given_accent_ok,
      ROUND(AVG(CASE WHEN accent_target <> accent_pred THEN meter_target == meter_pred END), 3) AS meter_ok_given_accent_bad,
      ROUND(AVG(accent_pred == accent_target), 3) AS accent_ok_total,
      ROUND(AVG(meter_target == meter_pred), 3) AS meter_ok_total,
      COUNT(*) as total
  FROM predictions
  GROUP BY meter_target
  ORDER BY total DESC;
#+end_src

#+RESULTS:
| meter_target | meter_ok_given_accent_ok | meter_ok_given_accent_bad | accent_ok_total | meter_ok_total | total |
|--------------+--------------------------+---------------------------+-----------------+----------------+-------|
| Я00          |                    0.995 |                     0.293 |           0.984 |          0.984 | 68810 |
| Х00          |                      1.0 |                      0.26 |           0.962 |          0.972 | 26126 |
| Дк00         |                    0.925 |                      0.39 |           0.706 |          0.767 | 10649 |
| Аф00         |                    0.993 |                     0.055 |           0.951 |          0.947 | 10293 |
| Ан00         |                      1.0 |                     0.057 |           0.935 |          0.938 |  9954 |
| Д00          |                    0.865 |                     0.032 |           0.911 |          0.791 |  6338 |
| Тк00         |                    0.831 |                     0.286 |           0.452 |          0.532 |  1689 |
| Гек00        |                    0.439 |                     0.436 |            0.88 |          0.439 |   918 |
| С00          |                      1.0 |                     0.064 |           0.458 |          0.493 |   716 |
| Ак00         |                     0.29 |                     0.287 |           0.525 |          0.288 |   617 |
| ЯЯ0          |                    0.289 |                     0.009 |            0.72 |           0.21 |   414 |
| ХХ0          |                    0.938 |                     0.066 |           0.587 |          0.578 |   332 |
| Л00          |                      0.0 |                       0.0 |           0.643 |            0.0 |   294 |
| АнАн0        |                      0.0 |                       0.0 |           0.497 |            0.0 |   197 |
| ДД0          |                    0.539 |                       0.0 |           0.783 |          0.422 |   180 |
| ЯЯЯ          |                      0.0 |                       0.0 |           0.875 |            0.0 |    40 |
| АфАф0        |                      0.0 |                       0.0 |           0.833 |            0.0 |    24 |
| Пен00        |                      0.0 |                       0.0 |           0.381 |            0.0 |    21 |
| ХХХ          |                          |                       0.0 |             0.0 |            0.0 |     6 |
| ЯХ0          |                      0.0 |                       0.0 |             0.5 |            0.0 |     4 |
| ДЯ0          |                          |                       0.5 |             0.0 |            0.5 |     2 |
| ХЯ0          |                          |                       0.0 |             0.0 |            0.0 |     1 |
| ДАн0         |                      0.0 |                           |             1.0 |            0.0 |     1 |
| АфД0         |                          |                       0.0 |             0.0 |            0.0 |     1 |
| АфАн0        |                      0.0 |                           |             1.0 |            0.0 |     1 |

Типы цезур, предсказанные корректно
#+begin_src sqlite
  SELECT
      caesura_target AS caesura,
      meter_target,
      meter_pred,
      COUNT(*) AS cnt
  FROM predictions
  WHERE caesura_target == caesura_pred AND caesura_target <> '--'
  GROUP BY caesura_target, caesura_pred, meter_target, meter_pred
  ORDER BY cnt DESC
#+end_src

#+RESULTS:
| caesura | meter_target | meter_pred | cnt |
|---------+--------------+------------+-----|
|      7- | ХХ0          | ХХ0        | 185 |
|      7- | ДД0          | ДД0        |  76 |
|      7- | ЯЯ0          | ЯЯ0        |  41 |
|      7- | Пен00        | ДД0        |   2 |
|      3- | ХХ0          | ХЯ0        |   1 |

Статистика предсказаний перебоев
#+begin_src sqlite
  SELECT
      unstable_target,
      unstable_pred,
      COUNT(*) * 1.0 / SUM(COUNT(*)) OVER () AS global_ratio,
      COUNT(*) AS cnt
  FROM predictions
  GROUP BY unstable_target, unstable_pred
  ORDER BY unstable_target, unstable_pred;
#+end_src

#+RESULTS:
| unstable_target | unstable_pred |         global_ratio |    cnt |
|-----------------+---------------+----------------------+--------|
|               0 |             0 |    0.999266137704537 | 137527 |
|               1 |             0 | 0.000733862295463133 |    101 |

Ошибки при определении дактиля
#+begin_src sqlite
  SELECT meter_pred, accent_pred == accent_target AS accent_ok, COUNT(*) as cnt
  FROM predictions
  WHERE meter_target = 'Д00' AND meter_target <> meter_pred
  GROUP BY meter_pred, accent_ok
  ORDER BY cnt DESC
  LIMIT 5
#+end_src

#+RESULTS:
| meter_pred | accent_ok | cnt |
|------------+-----------+-----|
| Аф00       |         1 | 727 |
| Дк00       |         0 | 213 |
| Я00        |         0 | 118 |
| Тк00       |         0 |  71 |
| Х00        |         0 |  58 |

Ошибки при определении гекзаметра:
#+begin_src sqlite
  SELECT meter_pred, accent_pred == accent_target AS accent_ok, COUNT(*) as cnt
  FROM predictions
  WHERE meter_target = 'Гек00' AND meter_target <> meter_pred
  GROUP BY meter_pred, accent_ok
  ORDER BY cnt DESC
  LIMIT 5
#+end_src

#+RESULTS:
| meter_pred | accent_ok | cnt |
|------------+-----------+-----|
| Аф00       |         1 | 421 |
| Л00        |         1 |  20 |
| Тк00       |         0 |  18 |
| Ак00       |         0 |  15 |
| Дк00       |         0 |  12 |

Распределение правильных предсказаний метра по количеству стоп в строке
#+begin_src sqlite
  SELECT
      feet,
      AVG(meter_pred = meter_target) AS correct_ratio,
      COUNT(*) as cnt
  FROM (
      SELECT
          meter_pred,
          meter_target,
          LENGTH(REPLACE(accent_target, '0', '')) AS feet
      FROM predictions
  )
  GROUP BY feet
  ORDER BY feet;
#+end_src

#+RESULTS:
| feet |     correct_ratio |   cnt |
|------+-------------------+-------|
|    0 |               0.5 |     8 |
|    1 | 0.387173396674584 |  1684 |
|    2 |  0.83562532433835 |  7708 |
|    3 | 0.911087902523934 | 28725 |
|    4 | 0.958485692240598 | 59618 |
|    5 |  0.96748788368336 | 24760 |
|    6 | 0.878077783995523 | 14296 |
|    7 | 0.721603563474387 |   449 |
|    8 | 0.893103448275862 |   290 |
|    9 | 0.423076923076923 |    26 |
|   10 | 0.921052631578947 |    38 |
|   11 |               0.4 |     5 |
|   12 | 0.933333333333333 |    15 |
|   13 |               0.0 |     1 |
|   14 |               1.0 |     1 |
|   15 |               0.0 |     1 |
|   20 |               0.0 |     2 |
|   26 |               0.0 |     1 |
